Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateRail Property
 Can't create Railing. Thickness of Rail or Balusters might be too small. If you don't want Balusters, specify "None" for Baluster Shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateRail { get; }
Public Shared ReadOnly Property CannotCreateRail As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateRail {
	FailureDefinitionId^ get ();
}
static member CannotCreateRail : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace